src/Catalogs/ШаблоныДокументов/ШаблоныДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныДокументов</name>
  <predefined>
    <items>
      <name>ЗапросСправки2НДФЛ</name>
      <description>Запрос справки 2-НДФЛ</description>
    </items>
    <items>
      <name>ЗапросСправкиПоОстаткамОтпуска</name>
      <description>Запрос справки по остаткам отпуска</description>
    </items>
    <items>
      <name>ЗапросСправкиСМестаРаботы</name>
      <description>Запрос справки с места работы</description>
    </items>
    <items>
      <name>ЗаявлениеНаКомпенсациюОтпуска</name>
      <description>Заявление на компенсацию отпуска</description>
    </items>
    <items>
      <name>ЗаявлениеНаНалоговыеВычеты</name>
      <description>Заявление на налоговые вычеты</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтмену</name>
      <description>Заявление на отмену</description>
    </items>
    <items>
      <name>ЗаявлениеНаОтпуск</name>
      <description>Заявление на отпуск</description>
    </items>
    <items>
      <name>ЗаявлениеНаПереносОтпуска</name>
      <description>Заявление на перенос отпуска</description>
    </items>
    <items>
      <name>ЗаявлениеНаУдержаниеДСВ</name>
      <description>Заявление на удержание ДСВ</description>
    </items>
    <items>
      <name>ЗаявлениеОбИзмененииЛичныхДанных</name>
      <description>Заявление об изменении личных данных</description>
    </items>
    <items>
      <name>Отсутствие</name>
      <description>Отсутствие</description>
    </items>
  </predefined>
  <attributes>
    <name>МакетДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешНастроек</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяСогласование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДокументаКадровогоМероприятия</name>
    <type>
      <types>CatalogRef.КодыДокументовКадровыхМероприятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПодписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяНаличиеВложений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Настройки</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ШаблоныДокументов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		СсылкаШаблона = ДополнительныеСвойства.СсылкаШаблона;
		УстановитьСсылкуНового(ДополнительныеСвойства.СсылкаШаблона);
		Если Не ЗначениеЗаполнено(Версия) Тогда
			Версия = КабинетСотрудника.ВерсияФормата();
		КонецЕсли;
		Версия = Справочники.ШаблоныДокументов.НормализованныйНомерВерсии(Версия);
	Иначе
		СсылкаШаблона = Ссылка;
	КонецЕсли;
	
	ХешНастроек = Справочники.ШаблоныДокументов.ХешНастроек(
		ВАрхиве, МакетДокумента, СсылкаШаблона.УникальныйИдентификатор());
	
	НастройкиВарианта = Справочники.ШаблоныДокументов.JSONШаблонаДокументаПоИдентификаторуШаблона(МакетДокумента.Получить(), СсылкаШаблона.УникальныйИдентификатор());
	Настройки = Новый ХранилищеЗначения(НастройкиВарианта, Новый СжатиеДанных(9));
	
	Если Не ЭтоНовый() Тогда
		РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "ХешНастроек, Версия, Изменен, Настройки");
		Если ХешНастроек <> РеквизитыОбъекта.ХешНастроек Тогда
			ПрежниеНастройкиВарианта = РеквизитыОбъекта.Настройки.Получить();
			Если Справочники.ШаблоныДокументов.JSONШаблоныРазличны(ПрежниеНастройкиВарианта, НастройкиВарианта) Тогда
				СохранитьПрежнююВерсию = Истина;
				Если ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
					Если РеквизитыОбъекта.Изменен Тогда
						ПредопределенныеВерсии = Справочники.ШаблоныДокументов.ПредопределенныеВерсииШаблонов(ИмяПредопределенныхДанных);
						СтрокаВерсии = ПредопределенныеВерсии.Найти(Версия, "Версия");
						Если СтрокаВерсии <> Неопределено
							И Не Справочники.ШаблоныДокументов.JSONШаблоныРазличны(СтрокаВерсии.Настройки, НастройкиВарианта) Тогда
							
							Изменен = Ложь;
						КонецЕсли;
					Иначе
						СохранитьПрежнююВерсию = Ложь;
						Изменен = Истина;
					КонецЕсли;
				КонецЕсли;
				Если СохранитьПрежнююВерсию Тогда
					НоваяСтрока = ИсторияИзменений.Добавить();
					НоваяСтрока.Версия = Справочники.ШаблоныДокументов.НормализованныйНомерВерсии(РеквизитыОбъекта.Версия);
					НоваяСтрока.ДатаРегистрации = ТекущаяДатаСеанса();
					НоваяСтрока.Настройки = Новый ХранилищеЗначения(ПрежниеНастройкиВарианта, Новый СжатиеДанных(9));
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(ИмяПредопределенныхДанных) Тогда
				Изменен = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
